garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f26q24.inc
// Register: IPR4
#define IPR4 IPR4
IPR4                                     equ 04A2h
// bitfield definitions
IPR4_U1RXIP_POSN                         equ 0000h
IPR4_U1RXIP_POSITION                     equ 0000h
IPR4_U1RXIP_SIZE                         equ 0001h
IPR4_U1RXIP_LENGTH                       equ 0001h
IPR4_U1RXIP_MASK                         equ 0001h
IPR4_U1TXIP_POSN                         equ 0001h
IPR4_U1TXIP_POSITION                     equ 0001h
IPR4_U1TXIP_SIZE                         equ 0001h
IPR4_U1TXIP_LENGTH                       equ 0001h
IPR4_U1TXIP_MASK                         equ 0002h
IPR4_U1EIP_POSN                          equ 0002h
IPR4_U1EIP_POSITION                      equ 0002h
IPR4_U1EIP_SIZE                          equ 0001h
IPR4_U1EIP_LENGTH                        equ 0001h
IPR4_U1EIP_MASK                          equ 0004h
IPR4_U1IP_POSN                           equ 0003h
IPR4_U1IP_POSITION                       equ 0003h
IPR4_U1IP_SIZE                           equ 0001h
IPR4_U1IP_LENGTH                         equ 0001h
IPR4_U1IP_MASK                           equ 0008h
IPR4_TMR3IP_POSN                         equ 0004h
IPR4_TMR3IP_POSITION                     equ 0004h
IPR4_TMR3IP_SIZE                         equ 0001h
IPR4_TMR3IP_LENGTH                       equ 0001h
IPR4_TMR3IP_MASK                         equ 0010h
IPR4_TMR3GIP_POSN                        equ 0005h
IPR4_TMR3GIP_POSITION                    equ 0005h
IPR4_TMR3GIP_SIZE                        equ 0001h
IPR4_TMR3GIP_LENGTH                      equ 0001h
IPR4_TMR3GIP_MASK                        equ 0020h
IPR4_PWM1PIP_POSN                        equ 0006h
IPR4_PWM1PIP_POSITION                    equ 0006h
IPR4_PWM1PIP_SIZE                        equ 0001h
IPR4_PWM1PIP_LENGTH                      equ 0001h
IPR4_PWM1PIP_MASK                        equ 0040h
IPR4_PWM1IP_POSN                         equ 0007h
IPR4_PWM1IP_POSITION                     equ 0007h
IPR4_PWM1IP_SIZE                         equ 0001h
IPR4_PWM1IP_LENGTH                       equ 0001h
IPR4_PWM1IP_MASK                         equ 0080h

// Register: IPR5
#define IPR5 IPR5
IPR5                                     equ 04A3h
// bitfield definitions
IPR5_CLC6IP_POSN                         equ 0001h
IPR5_CLC6IP_POSITION                     equ 0001h
IPR5_CLC6IP_SIZE                         equ 0001h
IPR5_CLC6IP_LENGTH                       equ 0001h
IPR5_CLC6IP_MASK                         equ 0002h
IPR5_TU16AIP_POSN                        equ 0002h
IPR5_TU16AIP_POSITION                    equ 0002h
IPR5_TU16AIP_SIZE                        equ 0001h
IPR5_TU16AIP_LENGTH                      equ 0001h
IPR5_TU16AIP_MASK                        equ 0004h
IPR5_TMR6IP_POSN                         equ 0003h
IPR5_TMR6IP_POSITION                     equ 0003h
IPR5_TMR6IP_SIZE                         equ 0001h
IPR5_TMR6IP_LENGTH                       equ 0001h
IPR5_TMR6IP_MASK                         equ 0008h
IPR5_C2IP_POSN                           equ 0004h
IPR5_C2IP_POSITION                       equ 0004h
IPR5_C2IP_SIZE                           equ 0001h
IPR5_C2IP_LENGTH                         equ 0001h
IPR5_C2IP_MASK                           equ 0010h
IPR5_CLC2IP_POSN                         equ 0005h
IPR5_CLC2IP_POSITION                     equ 0005h
IPR5_CLC2IP_SIZE                         equ 0001h
IPR5_CLC2IP_LENGTH                       equ 0001h
IPR5_CLC2IP_MASK                         equ 0020h
IPR5_PWM2PIP_POSN                        equ 0006h
IPR5_PWM2PIP_POSITION                    equ 0006h
IPR5_PWM2PIP_SIZE                        equ 0001h
IPR5_PWM2PIP_LENGTH                      equ 0001h
IPR5_PWM2PIP_MASK                        equ 0040h
IPR5_PWM2IP_POSN                         equ 0007h
IPR5_PWM2IP_POSITION                     equ 0007h
IPR5_PWM2IP_SIZE                         equ 0001h
IPR5_PWM2IP_LENGTH                       equ 0001h
IPR5_PWM2IP_MASK                         equ 0080h

// Register: IPR6
#define IPR6 IPR6
IPR6                                     equ 04A4h
// bitfield definitions
IPR6_INT1IP_POSN                         equ 0000h
IPR6_INT1IP_POSITION                     equ 0000h
IPR6_INT1IP_SIZE                         equ 0001h
IPR6_INT1IP_LENGTH                       equ 0001h
IPR6_INT1IP_MASK                         equ 0001h
IPR6_CLC7IP_POSN                         equ 0001h
IPR6_CLC7IP_POSITION                     equ 0001h
IPR6_CLC7IP_SIZE                         equ 0001h
IPR6_CLC7IP_LENGTH                       equ 0001h
IPR6_CLC7IP_MASK                         equ 0002h
IPR6_CWG1IP_POSN                         equ 0002h
IPR6_CWG1IP_POSITION                     equ 0002h
IPR6_CWG1IP_SIZE                         equ 0001h
IPR6_CWG1IP_LENGTH                       equ 0001h
IPR6_CWG1IP_MASK                         equ 0004h
IPR6_NCO1IP_POSN                         equ 0003h
IPR6_NCO1IP_POSITION                     equ 0003h
IPR6_NCO1IP_SIZE                         equ 0001h
IPR6_NCO1IP_LENGTH                       equ 0001h
IPR6_NCO1IP_MASK                         equ 0008h
IPR6_DMA2SCNTIP_POSN                     equ 0004h
IPR6_DMA2SCNTIP_POSITION                 equ 0004h
IPR6_DMA2SCNTIP_SIZE                     equ 0001h
IPR6_DMA2SCNTIP_LENGTH                   equ 0001h
IPR6_DMA2SCNTIP_MASK                     equ 0010h
IPR6_DMA2DCNTIP_POSN                     equ 0005h
IPR6_DMA2DCNTIP_POSITION                 equ 0005h
IPR6_DMA2DCNTIP_SIZE                     equ 0001h
IPR6_DMA2DCNTIP_LENGTH                   equ 0001h
IPR6_DMA2DCNTIP_MASK                     equ 0020h
IPR6_DMA2ORIP_POSN                       equ 0006h
IPR6_DMA2ORIP_POSITION                   equ 0006h
IPR6_DMA2ORIP_SIZE                       equ 0001h
IPR6_DMA2ORIP_LENGTH                     equ 0001h
IPR6_DMA2ORIP_MASK                       equ 0040h
IPR6_DMA2AIP_POSN                        equ 0007h
IPR6_DMA2AIP_POSITION                    equ 0007h
IPR6_DMA2AIP_SIZE                        equ 0001h
IPR6_DMA2AIP_LENGTH                      equ 0001h
IPR6_DMA2AIP_MASK                        equ 0080h

// Register: IPR7
#define IPR7 IPR7
IPR7                                     equ 04A5h
// bitfield definitions
IPR7_I2C1RXIP_POSN                       equ 0000h
IPR7_I2C1RXIP_POSITION                   equ 0000h
IPR7_I2C1RXIP_SIZE                       equ 0001h
IPR7_I2C1RXIP_LENGTH                     equ 0001h
IPR7_I2C1RXIP_MASK                       equ 0001h
IPR7_I2C1TXIP_POSN                       equ 0001h
IPR7_I2C1TXIP_POSITION                   equ 0001h
IPR7_I2C1TXIP_SIZE                       equ 0001h
IPR7_I2C1TXIP_LENGTH                     equ 0001h
IPR7_I2C1TXIP_MASK                       equ 0002h
IPR7_I2C1IP_POSN                         equ 0002h
IPR7_I2C1IP_POSITION                     equ 0002h
IPR7_I2C1IP_SIZE                         equ 0001h
IPR7_I2C1IP_LENGTH                       equ 0001h
IPR7_I2C1IP_MASK                         equ 0004h
IPR7_I2C1EIP_POSN                        equ 0003h
IPR7_I2C1EIP_POSITION                    equ 0003h
IPR7_I2C1EIP_SIZE                        equ 0001h
IPR7_I2C1EIP_LENGTH                      equ 0001h
IPR7_I2C1EIP_MASK                        equ 0008h
IPR7_CLC3IP_POSN                         equ 0005h
IPR7_CLC3IP_POSITION                     equ 0005h
IPR7_CLC3IP_SIZE                         equ 0001h
IPR7_CLC3IP_LENGTH                       equ 0001h
IPR7_CLC3IP_MASK                         equ 0020h
IPR7_PWM3PIP_POSN                        equ 0006h
IPR7_PWM3PIP_POSITION                    equ 0006h
IPR7_PWM3PIP_SIZE                        equ 0001h
IPR7_PWM3PIP_LENGTH                      equ 0001h
IPR7_PWM3PIP_MASK                        equ 0040h
IPR7_PWM3IP_POSN                         equ 0007h
IPR7_PWM3IP_POSITION                     equ 0007h
IPR7_PWM3IP_SIZE                         equ 0001h
IPR7_PWM3IP_LENGTH                       equ 0001h
IPR7_PWM3IP_MASK                         equ 0080h

// Register: IPR8
#define IPR8 IPR8
IPR8                                     equ 04A6h
// bitfield definitions
IPR8_U2RXIP_POSN                         equ 0000h
IPR8_U2RXIP_POSITION                     equ 0000h
IPR8_U2RXIP_SIZE                         equ 0001h
IPR8_U2RXIP_LENGTH                       equ 0001h
IPR8_U2RXIP_MASK                         equ 0001h
IPR8_U2TXIP_POSN                         equ 0001h
IPR8_U2TXIP_POSITION                     equ 0001h
IPR8_U2TXIP_SIZE                         equ 0001h
IPR8_U2TXIP_LENGTH                       equ 0001h
IPR8_U2TXIP_MASK                         equ 0002h
IPR8_U2EIP_POSN                          equ 0002h
IPR8_U2EIP_POSITION                      equ 0002h
IPR8_U2EIP_SIZE                          equ 0001h
IPR8_U2EIP_LENGTH                        equ 0001h
IPR8_U2EIP_MASK                          equ 0004h
IPR8_U2IP_POSN                           equ 0003h
IPR8_U2IP_POSITION                       equ 0003h
IPR8_U2IP_SIZE                           equ 0001h
IPR8_U2IP_LENGTH                         equ 0001h
IPR8_U2IP_MASK                           equ 0008h
IPR8_CLC4IP_POSN                         equ 0005h
IPR8_CLC4IP_POSITION                     equ 0005h
IPR8_CLC4IP_SIZE                         equ 0001h
IPR8_CLC4IP_LENGTH                       equ 0001h
IPR8_CLC4IP_MASK                         equ 0020h
IPR8_CCP2IP_POSN                         equ 0006h
IPR8_CCP2IP_POSITION                     equ 0006h
IPR8_CCP2IP_SIZE                         equ 0001h
IPR8_CCP2IP_LENGTH                       equ 0001h
IPR8_CCP2IP_MASK                         equ 0040h
IPR8_SCANIP_POSN                         equ 0007h
IPR8_SCANIP_POSITION                     equ 0007h
IPR8_SCANIP_SIZE                         equ 0001h
IPR8_SCANIP_LENGTH                       equ 0001h
IPR8_SCANIP_MASK                         equ 0080h

// Register: IPR9
#define IPR9 IPR9
IPR9                                     equ 04A7h
// bitfield definitions
IPR9_C1IP_POSN                           equ 0000h
IPR9_C1IP_POSITION                       equ 0000h
IPR9_C1IP_SIZE                           equ 0001h
IPR9_C1IP_LENGTH                         equ 0001h
IPR9_C1IP_MASK                           equ 0001h
IPR9_DMA3SCNTIP_POSN                     equ 0004h
IPR9_DMA3SCNTIP_POSITION                 equ 0004h
IPR9_DMA3SCNTIP_SIZE                     equ 0001h
IPR9_DMA3SCNTIP_LENGTH                   equ 0001h
IPR9_DMA3SCNTIP_MASK                     equ 0010h
IPR9_DMA3DCNTIP_POSN                     equ 0005h
IPR9_DMA3DCNTIP_POSITION                 equ 0005h
IPR9_DMA3DCNTIP_SIZE                     equ 0001h
IPR9_DMA3DCNTIP_LENGTH                   equ 0001h
IPR9_DMA3DCNTIP_MASK                     equ 0020h
IPR9_DMA3ORIP_POSN                       equ 0006h
IPR9_DMA3ORIP_POSITION                   equ 0006h
IPR9_DMA3ORIP_SIZE                       equ 0001h
IPR9_DMA3ORIP_LENGTH                     equ 0001h
IPR9_DMA3ORIP_MASK                       equ 0040h
IPR9_DMA3AIP_POSN                        equ 0007h
IPR9_DMA3AIP_POSITION                    equ 0007h
IPR9_DMA3AIP_SIZE                        equ 0001h
IPR9_DMA3AIP_LENGTH                      equ 0001h
IPR9_DMA3AIP_MASK                        equ 0080h

// Register: IPR10
#define IPR10 IPR10
IPR10                                    equ 04A8h
// bitfield definitions
IPR10_INT2IP_POSN                        equ 0000h
IPR10_INT2IP_POSITION                    equ 0000h
IPR10_INT2IP_SIZE                        equ 0001h
IPR10_INT2IP_LENGTH                      equ 0001h
IPR10_INT2IP_MASK                        equ 0001h
IPR10_CLC8IP_POSN                        equ 0001h
IPR10_CLC8IP_POSITION                    equ 0001h
IPR10_CLC8IP_SIZE                        equ 0001h
IPR10_CLC8IP_LENGTH                      equ 0001h
IPR10_CLC8IP_MASK                        equ 0002h
IPR10_TU16BIP_POSN                       equ 0002h
IPR10_TU16BIP_POSITION                   equ 0002h
IPR10_TU16BIP_SIZE                       equ 0001h
IPR10_TU16BIP_LENGTH                     equ 0001h
IPR10_TU16BIP_MASK                       equ 0004h
IPR10_TMR4IP_POSN                        equ 0003h
IPR10_TMR4IP_POSITION                    equ 0003h
IPR10_TMR4IP_SIZE                        equ 0001h
IPR10_TMR4IP_LENGTH                      equ 0001h
IPR10_TMR4IP_MASK                        equ 0008h
IPR10_DMA4SCNTIP_POSN                    equ 0004h
IPR10_DMA4SCNTIP_POSITION                equ 0004h
IPR10_DMA4SCNTIP_SIZE                    equ 0001h
IPR10_DMA4SCNTIP_LENGTH                  equ 0001h
IPR10_DMA4SCNTIP_MASK                    equ 0010h
IPR10_DMA4DCNTIP_POSN                    equ 0005h
IPR10_DMA4DCNTIP_POSITION                equ 0005h
IPR10_DMA4DCNTIP_SIZE                    equ 0001h
IPR10_DMA4DCNTIP_LENGTH                  equ 0001h
IPR10_DMA4DCNTIP_MASK                    equ 0020h
IPR10_DMA4ORIP_POSN                      equ 0006h
IPR10_DMA4ORIP_POSITION                  equ 0006h
IPR10_DMA4ORIP_SIZE                      equ 0001h
IPR10_DMA4ORIP_LENGTH                    equ 0001h
IPR10_DMA4ORIP_MASK                      equ 0040h
IPR10_DMA4AIP_POSN                       equ 0007h
IPR10_DMA4AIP_POSITION                   equ 0007h
IPR10_DMA4AIP_SIZE                       equ 0001h
IPR10_DMA4AIP_LENGTH                     equ 0001h
IPR10_DMA4AIP_MASK                       equ 0080h

// Register: IPR11
#define IPR11 IPR11
IPR11                                    equ 04A9h
// bitfield definitions
IPR11_SPI2RXIP_POSN                      equ 0000h
IPR11_SPI2RXIP_POSITION                  equ 0000h
IPR11_SPI2RXIP_SIZE                      equ 0001h
IPR11_SPI2RXIP_LENGTH                    equ 0001h
IPR11_SPI2RXIP_MASK                      equ 0001h
IPR11_SPI2TXIP_POSN                      equ 0001h
IPR11_SPI2TXIP_POSITION                  equ 0001h
IPR11_SPI2TXIP_SIZE                      equ 0001h
IPR11_SPI2TXIP_LENGTH                    equ 0001h
IPR11_SPI2TXIP_MASK                      equ 0002h
IPR11_SPI2IP_POSN                        equ 0002h
IPR11_SPI2IP_POSITION                    equ 0002h
IPR11_SPI2IP_SIZE                        equ 0001h
IPR11_SPI2IP_LENGTH                      equ 0001h
IPR11_SPI2IP_MASK                        equ 0004h
IPR11_VDDIO2LVDIP_POSN                   equ 0003h
IPR11_VDDIO2LVDIP_POSITION               equ 0003h
IPR11_VDDIO2LVDIP_SIZE                   equ 0001h
IPR11_VDDIO2LVDIP_LENGTH                 equ 0001h
IPR11_VDDIO2LVDIP_MASK                   equ 0008h
IPR11_VDDIO2nRDYIP_POSN                  equ 0004h
IPR11_VDDIO2nRDYIP_POSITION              equ 0004h
IPR11_VDDIO2nRDYIP_SIZE                  equ 0001h
IPR11_VDDIO2nRDYIP_LENGTH                equ 0001h
IPR11_VDDIO2nRDYIP_MASK                  equ 0010h

// Register: PIE0
#define PIE0 PIE0
PIE0                                     equ 04AAh
// bitfield definitions
PIE0_SWIE_POSN                           equ 0000h
PIE0_SWIE_POSITION                       equ 0000h
PIE0_SWIE_SIZE                           equ 0001h
PIE0_SWIE_LENGTH                         equ 0001h
PIE0_SWIE_MASK                           equ 0001h
PIE0_HLVDIE_POSN                         equ 0001h
PIE0_HLVDIE_POSITION                     equ 0001h
PIE0_HLVDIE_SIZE                         equ 0001h
PIE0_HLVDIE_LENGTH                       equ 0001h
PIE0_HLVDIE_MASK                         equ 0002h
PIE0_OSFIE_POSN                          equ 0002h
PIE0_OSFIE_POSITION                      equ 0002h
PIE0_OSFIE_SIZE                          equ 0001h
PIE0_OSFIE_LENGTH                        equ 0001h
PIE0_OSFIE_MASK                          equ 0004h
PIE0_CSWIE_POSN                          equ 0003h
PIE0_CSWIE_POSITION                      equ 0003h
PIE0_CSWIE_SIZE                          equ 0001h
PIE0_CSWIE_LENGTH                        equ 0001h
PIE0_CSWIE_MASK                          equ 0008h
PIE0_NVMIE_POSN                          equ 0004h
PIE0_NVMIE_POSITION                      equ 0004h
PIE0_NVMIE_SIZE                          equ 0001h
PIE0_NVMIE_LENGTH                        equ 0001h
PIE0_NVMIE_MASK                          equ 0010h
PIE0_CLC1IE_POSN                         equ 0005h
PIE0_CLC1IE_POSITION                     equ 0005h
PIE0_CLC1IE_SIZE                         equ 0001h
PIE0_CLC1IE_LENGTH                       equ 0001h
PIE0_CLC1IE_MASK                         equ 0020h
PIE0_CRCIE_POSN                          equ 0006h
PIE0_CRCIE_POSITION                      equ 0006h
PIE0_CRCIE_SIZE                          equ 0001h
PIE0_CRCIE_LENGTH                        equ 0001h
PIE0_CRCIE_MASK                          equ 0040h
PIE0_IOCIE_POSN                          equ 0007h
PIE0_IOCIE_POSITION                      equ 0007h
PIE0_IOCIE_SIZE                          equ 0001h
PIE0_IOCIE_LENGTH                        equ 0001h
PIE0_IOCIE_MASK                          equ 0080h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 04ABh
// bitfield definitions
PIE1_INT0IE_POSN                         equ 0000h
PIE1_INT0IE_POSITION                     equ 0000h
PIE1_INT0IE_SIZE                         equ 0001h
PIE1_INT0IE_LENGTH                       equ 0001h
PIE1_INT0IE_MASK                         equ 0001h
PIE1_ADTIE_POSN                          equ 0001h
PIE1_ADTIE_POSITION                      equ 0001h
PIE1_ADTIE_SIZE                          equ 0001h
PIE1_ADTIE_LENGTH                        equ 0001h
PIE1_ADTIE_MASK                          equ 0002h
PIE1_ADIE_POSN                           equ 0002h
PIE1_ADIE_POSITION                       equ 0002h
PIE1_ADIE_SIZE                           equ 0001h
PIE1_ADIE_LENGTH                         equ 0001h
PIE1_ADIE_MASK                           equ 0004h
PIE1_ACTIE_POSN                          equ 0003h
PIE1_ACTIE_POSITION                      equ 0003h
PIE1_ACTIE_SIZE                          equ 0001h
PIE1_ACTIE_LENGTH                        equ 0001h
PIE1_ACTIE_MASK                          equ 0008h
PIE1_I2C2RXIE_POSN                       equ 0004h
PIE1_I2C2RXIE_POSITION                   equ 0004h
PIE1_I2C2RXIE_SIZE                       equ 0001h
PIE1_I2C2RXIE_LENGTH                     equ 0001h
PIE1_I2C2RXIE_MASK                       equ 0010h
PIE1_I2C2TXIE_POSN                       equ 0005h
PIE1_I2C2TXIE_POSITION                   equ 0005h
PIE1_I2C2TXIE_SIZE                       equ 0001h
PIE1_I2C2TXIE_LENGTH                     equ 0001h
PIE1_I2C2TXIE_MASK                       equ 0020h
PIE1_I2C2IE_POSN                         equ 0006h
PIE1_I2C2IE_POSITION                     equ 0006h
PIE1_I2C2IE_SIZE                         equ 0001h
PIE1_I2C2IE_LENGTH                       equ 0001h
PIE1_I2C2IE_MASK                         equ 0040h
PIE1_I2C2EIE_POSN                        equ 0007h
PIE1_I2C2EIE_POSITION                    equ 0007h
PIE1_I2C2EIE_SIZE                        equ 0001h
PIE1_I2C2EIE_LENGTH                      equ 0001h
PIE1_I2C2EIE_MASK                        equ 0080h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 04ACh
// bitfield definitions
PIE2_ZCD2IE_POSN                         equ 0000h
PIE2_ZCD2IE_POSITION                     equ 0000h
PIE2_ZCD2IE_SIZE                         equ 0001h
PIE2_ZCD2IE_LENGTH                       equ 0001h
PIE2_ZCD2IE_MASK                         equ 0001h
PIE2_CLC5IE_POSN                         equ 0001h
PIE2_CLC5IE_POSITION                     equ 0001h
PIE2_CLC5IE_SIZE                         equ 0001h
PIE2_CLC5IE_LENGTH                       equ 0001h
PIE2_CLC5IE_MASK                         equ 0002h
PIE2_IOCSRIE_POSN                        equ 0002h
PIE2_IOCSRIE_POSITION                    equ 0002h
PIE2_IOCSRIE_SIZE                        equ 0001h
PIE2_IOCSRIE_LENGTH                      equ 0001h
PIE2_IOCSRIE_MASK                        equ 0004h
PIE2_ZCD1IE_POSN                         equ 0003h
PIE2_ZCD1IE_POSITION                     equ 0003h
PIE2_ZCD1IE_SIZE                         equ 0001h
PIE2_ZCD1IE_LENGTH                       equ 0001h
PIE2_ZCD1IE_MASK                         equ 0008h
PIE2_DMA1SCNTIE_POSN                     equ 0004h
PIE2_DMA1SCNTIE_POSITION                 equ 0004h
PIE2_DMA1SCNTIE_SIZE                     equ 0001h
PIE2_DMA1SCNTIE_LENGTH                   equ 0001h
PIE2_DMA1SCNTIE_MASK                     equ 0010h
PIE2_DMA1DCNTIE_POSN                     equ 0005h
PIE2_DMA1DCNTIE_POSITION                 equ 0005h
PIE2_DMA1DCNTIE_SIZE                     equ 0001h
PIE2_DMA1DCNTIE_LENGTH                   equ 0001h
PIE2_DMA1DCNTIE_MASK                     equ 0020h
PIE2_DMA1ORIE_POSN                       equ 0006h
PIE2_DMA1ORIE_POSITION                   equ 0006h
PIE2_DMA1ORIE_SIZE                       equ 0001h
PIE2_DMA1ORIE_LENGTH                     equ 0001h
PIE2_DMA1ORIE_MASK                       equ 0040h
PIE2_DMA1AIE_POSN                        equ 0007h
PIE2_DMA1AIE_POSITION                    equ 0007h
PIE2_DMA1AIE_SIZE                        equ 0001h
PIE2_DMA1AIE_LENGTH                      equ 0001h
PIE2_DMA1AIE_MASK                        equ 0080h

// Register: PIE3
#define PIE3 PIE3
PIE3                                     equ 04ADh
// bitfield definitions
PIE3_SPI1RXIE_POSN                       equ 0000h
PIE3_SPI1RXIE_POSITION                   equ 0000h
PIE3_SPI1RXIE_SIZE                       equ 0001h
PIE3_SPI1RXIE_LENGTH                     equ 0001h
PIE3_SPI1RXIE_MASK                       equ 0001h
PIE3_SPI1TXIE_POSN                       equ 0001h
PIE3_SPI1TXIE_POSITION                   equ 0001h
PIE3_SPI1TXIE_SIZE                       equ 0001h
PIE3_SPI1TXIE_LENGTH                     equ 0001h
PIE3_SPI1TXIE_MASK                       equ 0002h
PIE3_SPI1IE_POSN                         equ 0002h
PIE3_SPI1IE_POSITION                     equ 0002h
PIE3_SPI1IE_SIZE                         equ 0001h
PIE3_SPI1IE_LENGTH                       equ 0001h
PIE3_SPI1IE_MASK                         equ 0004h
PIE3_TMR2IE_POSN                         equ 0003h
PIE3_TMR2IE_POSITION                     equ 0003h
PIE3_TMR2IE_SIZE                         equ 0001h
PIE3_TMR2IE_LENGTH                       equ 0001h
PIE3_TMR2IE_MASK                         equ 0008h
PIE3_TMR1IE_POSN                         equ 0004h
PIE3_TMR1IE_POSITION                     equ 0004h
PIE3_TMR1IE_SIZE                         equ 0001h
PIE3_TMR1IE_LENGTH                       equ 0001h
PIE3_TMR1IE_MASK                         equ 0010h
PIE3_TMR1GIE_POSN                        equ 0005h
PIE3_TMR1GIE_POSITION                    equ 0005h
PIE3_TMR1GIE_SIZE                        equ 0001h
PIE3_TMR1GIE_LENGTH                      equ 0001h
PIE3_TMR1GIE_MASK                        equ 0020h
PIE3_CCP1IE_POSN                         equ 0006h
PIE3_CCP1IE_POSITION                     equ 0006h
PIE3_CCP1IE_SIZE                         equ 0001h
PIE3_CCP1IE_LENGTH                       equ 0001h
PIE3_CCP1IE_MASK                         equ 0040h
PIE3_TMR0IE_POSN                         equ 0007h
PIE3_TMR0IE_POSITION                     equ 0007h
PIE3_TMR0IE_SIZE                         equ 0001h
PIE3_TMR0IE_LENGTH                       equ 0001h
PIE3_TMR0IE_MASK                         equ 0080h

