garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f26q24.inc
#define NCO1INC5                         BANKMASK(NCO1INCL), 5, b
#define NCO1INC6                         BANKMASK(NCO1INCL), 6, b
#define NCO1INC7                         BANKMASK(NCO1INCL), 7, b
#define NCO1INC8                         BANKMASK(NCO1INCH), 0, b
#define NCO1INC9                         BANKMASK(NCO1INCH), 1, b
#define NCO1IP                           BANKMASK(IPR6), 3, a
#define NCO1MD                           BANKMASK(PMD2), 4, b
#define NCO1OUT                          BANKMASK(NCO1CON), 5, b
#define NCO1PFM                          BANKMASK(NCO1CON), 0, b
#define NCO1POL                          BANKMASK(NCO1CON), 4, b
#define NCO1PWS0                         BANKMASK(NCO1CLK), 5, b
#define NCO1PWS1                         BANKMASK(NCO1CLK), 6, b
#define NCO1PWS2                         BANKMASK(NCO1CLK), 7, b
#define NDIV0                            BANKMASK(OSCCON1), 0, b
#define NDIV1                            BANKMASK(OSCCON1), 1, b
#define NDIV2                            BANKMASK(OSCCON1), 2, b
#define NDIV3                            BANKMASK(OSCCON1), 3, b
#define NOSC0                            BANKMASK(OSCCON1), 4, b
#define NOSC1                            BANKMASK(OSCCON1), 5, b
#define NOSC2                            BANKMASK(OSCCON1), 6, b
#define NOSCR                            BANKMASK(OSCCON3), 3, b
#define NOT_BOR                          BANKMASK(PCON0), 0, a
#define NOT_HYS                          BANKMASK(VDDIO2CON), 4, b
#define NOT_IOMON                        BANKMASK(VDDIO2CON), 7, b
#define NOT_MEMV                         BANKMASK(PCON1), 1, a
#define NOT_POR                          BANKMASK(PCON0), 1, a
#define NOT_RCM                          BANKMASK(PCON1), 0, a
#define NOT_RI                           BANKMASK(PCON0), 2, a
#define NOT_RMCLR                        BANKMASK(PCON0), 3, a
#define NOT_RVREG                        BANKMASK(PCON1), 2, a
#define NOT_RWDT                         BANKMASK(PCON0), 4, a
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, b
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, b
#define NOT_T3DONE                       BANKMASK(T3GCON), 3, b
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, b
#define NOT_WDTWV                        BANKMASK(PCON0), 5, a
#define NREF0                            BANKMASK(ADREF), 4, b
#define NSS0                             BANKMASK(DAC1CON), 0, b
#define NVMADR0                          BANKMASK(NVMADRL), 0, b
#define NVMADR1                          BANKMASK(NVMADRL), 1, b
#define NVMADR10                         BANKMASK(NVMADRH), 2, b
#define NVMADR11                         BANKMASK(NVMADRH), 3, b
#define NVMADR12                         BANKMASK(NVMADRH), 4, b
#define NVMADR13                         BANKMASK(NVMADRH), 5, b
#define NVMADR14                         BANKMASK(NVMADRH), 6, b
#define NVMADR15                         BANKMASK(NVMADRH), 7, b
#define NVMADR16                         BANKMASK(NVMADRU), 0, b
#define NVMADR17                         BANKMASK(NVMADRU), 1, b
#define NVMADR18                         BANKMASK(NVMADRU), 2, b
#define NVMADR19                         BANKMASK(NVMADRU), 3, b
#define NVMADR2                          BANKMASK(NVMADRL), 2, b
#define NVMADR20                         BANKMASK(NVMADRU), 4, b
#define NVMADR21                         BANKMASK(NVMADRU), 5, b
#define NVMADR3                          BANKMASK(NVMADRL), 3, b
#define NVMADR4                          BANKMASK(NVMADRL), 4, b
#define NVMADR5                          BANKMASK(NVMADRL), 5, b
#define NVMADR6                          BANKMASK(NVMADRL), 6, b
#define NVMADR7                          BANKMASK(NVMADRL), 7, b
#define NVMADR8                          BANKMASK(NVMADRH), 0, b
#define NVMADR9                          BANKMASK(NVMADRH), 1, b
#define NVMDAT0                          BANKMASK(NVMDATL), 0, b
#define NVMDAT1                          BANKMASK(NVMDATL), 1, b
#define NVMDAT10                         BANKMASK(NVMDATH), 2, b
#define NVMDAT11                         BANKMASK(NVMDATH), 3, b
#define NVMDAT12                         BANKMASK(NVMDATH), 4, b
#define NVMDAT13                         BANKMASK(NVMDATH), 5, b
#define NVMDAT14                         BANKMASK(NVMDATH), 6, b
#define NVMDAT15                         BANKMASK(NVMDATH), 7, b
#define NVMDAT2                          BANKMASK(NVMDATL), 2, b
#define NVMDAT3                          BANKMASK(NVMDATL), 3, b
#define NVMDAT4                          BANKMASK(NVMDATL), 4, b
#define NVMDAT5                          BANKMASK(NVMDATL), 5, b
#define NVMDAT6                          BANKMASK(NVMDATL), 6, b
#define NVMDAT7                          BANKMASK(NVMDATL), 7, b
#define NVMDAT8                          BANKMASK(NVMDATH), 0, b
#define NVMDAT9                          BANKMASK(NVMDATH), 1, b
#define NVMGO                            BANKMASK(NVMCON0), 0, b
#define NVMIE                            BANKMASK(PIE0), 4, a
#define NVMIF                            BANKMASK(PIR0), 4, a
#define NVMIP                            BANKMASK(IPR0), 4, a
#define ODCA0                            BANKMASK(ODCONA), 0, b
#define ODCA1                            BANKMASK(ODCONA), 1, b
#define ODCA2                            BANKMASK(ODCONA), 2, b
#define ODCA3                            BANKMASK(ODCONA), 3, b
#define ODCA4                            BANKMASK(ODCONA), 4, b
#define ODCA5                            BANKMASK(ODCONA), 5, b
#define ODCA6                            BANKMASK(ODCONA), 6, b
#define ODCA7                            BANKMASK(ODCONA), 7, b
#define ODCB0                            BANKMASK(ODCONB), 0, b
#define ODCB1                            BANKMASK(ODCONB), 1, b
#define ODCB2                            BANKMASK(ODCONB), 2, b
#define ODCB3                            BANKMASK(ODCONB), 3, b
#define ODCB4                            BANKMASK(ODCONB), 4, b
#define ODCB5                            BANKMASK(ODCONB), 5, b
#define ODCB6                            BANKMASK(ODCONB), 6, b
#define ODCB7                            BANKMASK(ODCONB), 7, b
#define ODCC0                            BANKMASK(ODCONC), 0, b
#define ODCC1                            BANKMASK(ODCONC), 1, b
#define ODCC2                            BANKMASK(ODCONC), 2, b
#define ODCC3                            BANKMASK(ODCONC), 3, b
#define ODCC4                            BANKMASK(ODCONC), 4, b
#define ODCC5                            BANKMASK(ODCONC), 5, b
#define ODCC6                            BANKMASK(ODCONC), 6, b
#define OE0                              BANKMASK(DAC1CON), 4, b
#define OE1                              BANKMASK(DAC1CON), 5, b
#define ORDY                             BANKMASK(OSCCON3), 4, b
#define ORS                              BANKMASK(ACTCON), 1, b
#define OSFIE                            BANKMASK(PIE0), 2, a
#define OSFIF                            BANKMASK(PIR0), 2, a
#define OSFIP                            BANKMASK(IPR0), 2, a
#define OUT0                             BANKMASK(CRCOUTL), 0, b
#define OUT1                             BANKMASK(CRCOUTL), 1, b
#define OUT10                            BANKMASK(CRCOUTH), 2, b
#define OUT11                            BANKMASK(CRCOUTH), 3, b
#define OUT12                            BANKMASK(CRCOUTH), 4, b
#define OUT13                            BANKMASK(CRCOUTH), 5, b
#define OUT14                            BANKMASK(CRCOUTH), 6, b
#define OUT15                            BANKMASK(CRCOUTH), 7, b
#define OUT16                            BANKMASK(CRCOUTU), 0, b
#define OUT17                            BANKMASK(CRCOUTU), 1, b
#define OUT18                            BANKMASK(CRCOUTU), 2, b
#define OUT19                            BANKMASK(CRCOUTU), 3, b
#define OUT2                             BANKMASK(CRCOUTL), 2, b
#define OUT20                            BANKMASK(CRCOUTU), 4, b
#define OUT21                            BANKMASK(CRCOUTU), 5, b
#define OUT22                            BANKMASK(CRCOUTU), 6, b
#define OUT23                            BANKMASK(CRCOUTU), 7, b
#define OUT24                            BANKMASK(CRCOUTT), 0, b
#define OUT25                            BANKMASK(CRCOUTT), 1, b
#define OUT26                            BANKMASK(CRCOUTT), 2, b
#define OUT27                            BANKMASK(CRCOUTT), 3, b
#define OUT28                            BANKMASK(CRCOUTT), 4, b
#define OUT29                            BANKMASK(CRCOUTT), 5, b
#define OUT3                             BANKMASK(CRCOUTL), 3, b
#define OUT30                            BANKMASK(CRCOUTT), 6, b
#define OUT31                            BANKMASK(CRCOUTT), 7, b
#define OUT4                             BANKMASK(CRCOUTL), 4, b
#define OUT5                             BANKMASK(CRCOUTL), 5, b
#define OUT6                             BANKMASK(CRCOUTL), 6, b
#define OUT7                             BANKMASK(CRCOUTL), 7, b
#define OUT8                             BANKMASK(CRCOUTH), 0, b
#define OUT9                             BANKMASK(CRCOUTH), 1, b
#define OVRA                             BANKMASK(CWG1STR), 4, b
#define OVRB                             BANKMASK(CWG1STR), 5, b
#define OVRC                             BANKMASK(CWG1STR), 6, b
#define OVRD                             BANKMASK(CWG1STR), 7, b
#define P1H                              BANKMASK(U1P1H), 0, b
#define P2H                              BANKMASK(U1P2H), 0, b
#define P3H                              BANKMASK(U1P3H), 0, b
#define PC1IE                            BANKMASK(I2C1PIE), 2, b
#define PC1IF                            BANKMASK(I2C1PIR), 2, b
#define PC2IE                            BANKMASK(I2C2PIE), 2, b
#define PC2IF                            BANKMASK(I2C2PIR), 2, b
#define PCSC                             BANKMASK(ADCON1), 1, b
#define PFM                              BANKMASK(NCO1CON), 0, b
#define PLEN0                            BANKMASK(CRCCON1), 0, b
#define PLEN1                            BANKMASK(CRCCON1), 1, b
#define PLEN2                            BANKMASK(CRCCON1), 2, b
#define PLEN3                            BANKMASK(CRCCON1), 3, b
#define PLEN4                            BANKMASK(CRCCON1), 4, b
#define PLLEN                            BANKMASK(OSCEN), 0, b
#define PLLR                             BANKMASK(OSCSTAT), 0, b
#define PMSYS0                           BANKMASK(VREGCON), 4, b
#define PMSYS1                           BANKMASK(VREGCON), 5, b
#define POLA                             BANKMASK(CWG1CON1), 0, b
#define POLB                             BANKMASK(CWG1CON1), 1, b
#define POLC                             BANKMASK(CWG1CON1), 2, b
#define POLD                             BANKMASK(CWG1CON1), 3, b
#define POR                              BANKMASK(PCON0), 1, a
#define PORTWCLKPPS0                     BANKMASK(PORTWCLKPPS), 0, b
#define PORTWCLKPPS1                     BANKMASK(PORTWCLKPPS), 1, b
#define PORTWCLKPPS2                     BANKMASK(PORTWCLKPPS), 2, b
#define PORTWCLKPPS3                     BANKMASK(PORTWCLKPPS), 3, b
#define PORTWCLKPPS4                     BANKMASK(PORTWCLKPPS), 4, b
#define PORTWCLKPPS5                     BANKMASK(PORTWCLKPPS), 5, b
#define PORTWIN0PPS0                     BANKMASK(PORTWIN0PPS), 0, b
#define PORTWIN0PPS1                     BANKMASK(PORTWIN0PPS), 1, b
#define PORTWIN0PPS2                     BANKMASK(PORTWIN0PPS), 2, b
#define PORTWIN0PPS3                     BANKMASK(PORTWIN0PPS), 3, b
#define PORTWIN0PPS4                     BANKMASK(PORTWIN0PPS), 4, b
#define PORTWIN0PPS5                     BANKMASK(PORTWIN0PPS), 5, b
#define PORTWIN1PPS0                     BANKMASK(PORTWIN1PPS), 0, b
#define PORTWIN1PPS1                     BANKMASK(PORTWIN1PPS), 1, b
#define PORTWIN1PPS2                     BANKMASK(PORTWIN1PPS), 2, b
#define PORTWIN1PPS3                     BANKMASK(PORTWIN1PPS), 3, b
#define PORTWIN1PPS4                     BANKMASK(PORTWIN1PPS), 4, b
#define PORTWIN1PPS5                     BANKMASK(PORTWIN1PPS), 5, b
#define PORTWMD                          BANKMASK(PMD6), 0, b
#define PPOL                             BANKMASK(ADCON1), 7, b
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0, b
#define PRE0                             BANKMASK(ADPREL), 0, b
#define PRE1                             BANKMASK(ADPREL), 1, b
#define PRE10                            BANKMASK(ADPREH), 2, b
#define PRE11                            BANKMASK(ADPREH), 3, b
#define PRE12                            BANKMASK(ADPREH), 4, b
#define PRE2                             BANKMASK(ADPREL), 2, b
#define PRE3                             BANKMASK(ADPREL), 3, b
#define PRE4                             BANKMASK(ADPREL), 4, b
#define PRE5                             BANKMASK(ADPREL), 5, b
#define PRE6                             BANKMASK(ADPREL), 6, b
#define PRE7                             BANKMASK(ADPREL), 7, b
#define PRE8                             BANKMASK(ADPREH), 0, b
#define PRE9                             BANKMASK(ADPREH), 1, b
#define PREF0                            BANKMASK(ADREF), 0, b
#define PREF1                            BANKMASK(ADREF), 1, b
#define PREV0                            BANKMASK(ADPREVL), 0, b
#define PREV1                            BANKMASK(ADPREVL), 1, b
#define PREV10                           BANKMASK(ADPREVH), 2, b
#define PREV11                           BANKMASK(ADPREVH), 3, b
#define PREV12                           BANKMASK(ADPREVH), 4, b
#define PREV13                           BANKMASK(ADPREVH), 5, b
#define PREV14                           BANKMASK(ADPREVH), 6, b
#define PREV15                           BANKMASK(ADPREVH), 7, b
#define PREV2                            BANKMASK(ADPREVL), 2, b
#define PREV3                            BANKMASK(ADPREVL), 3, b
#define PREV4                            BANKMASK(ADPREVL), 4, b
#define PREV5                            BANKMASK(ADPREVL), 5, b
#define PREV6                            BANKMASK(ADPREVL), 6, b
#define PREV7                            BANKMASK(ADPREVL), 7, b
#define PREV8                            BANKMASK(ADPREVH), 0, b
#define PREV9                            BANKMASK(ADPREVH), 1, b
#define PRLOCKED                         BANKMASK(PRLOCK), 0, b
#define PSCNT0                           BANKMASK(WDTPSL), 0, b
#define PSCNT1                           BANKMASK(WDTPSL), 1, b
#define PSCNT10                          BANKMASK(WDTPSH), 2, b
#define PSCNT11                          BANKMASK(WDTPSH), 3, b
#define PSCNT12                          BANKMASK(WDTPSH), 4, b
#define PSCNT13                          BANKMASK(WDTPSH), 5, b
#define PSCNT14                          BANKMASK(WDTPSH), 6, b
#define PSCNT15                          BANKMASK(WDTPSH), 7, b
#define PSCNT16                          BANKMASK(WDTTMR), 0, b
#define PSCNT17                          BANKMASK(WDTTMR), 1, b
#define PSCNT2                           BANKMASK(WDTPSL), 2, b
#define PSCNT3                           BANKMASK(WDTPSL), 3, b
#define PSCNT4                           BANKMASK(WDTPSL), 4, b
#define PSCNT5                           BANKMASK(WDTPSL), 5, b
#define PSCNT6                           BANKMASK(WDTPSL), 6, b
#define PSCNT7                           BANKMASK(WDTPSL), 7, b
#define PSCNT8                           BANKMASK(WDTPSH), 0, b
#define PSCNT9                           BANKMASK(WDTPSH), 1, b
#define PSIS                             BANKMASK(ADCON2), 7, b
#define PSS0                             BANKMASK(DAC1CON), 2, b
#define PSS1                             BANKMASK(DAC1CON), 3, b
#define PWDF0                            BANKMASK(PORTWDF), 0, b
#define PWDF1                            BANKMASK(PORTWDF), 1, b
#define PWDF2                            BANKMASK(PORTWDF), 2, b
#define PWDF3                            BANKMASK(PORTWDF), 3, b
#define PWDF4                            BANKMASK(PORTWDF), 4, b
#define PWDF5                            BANKMASK(PORTWDF), 5, b
#define PWDF6                            BANKMASK(PORTWDF), 6, b
#define PWDF7                            BANKMASK(PORTWDF), 7, b
#define PWM1ERSPPS0                      BANKMASK(PWM1ERSPPS), 0, b
#define PWM1ERSPPS1                      BANKMASK(PWM1ERSPPS), 1, b
#define PWM1ERSPPS2                      BANKMASK(PWM1ERSPPS), 2, b
#define PWM1ERSPPS3                      BANKMASK(PWM1ERSPPS), 3, b
#define PWM1ERSPPS4                      BANKMASK(PWM1ERSPPS), 4, b
#define PWM1ERSPPS5                      BANKMASK(PWM1ERSPPS), 5, b
#define PWM1IE                           BANKMASK(PIE4), 7, a
#define PWM1IF                           BANKMASK(PIR4), 7, a
#define PWM1IP                           BANKMASK(IPR4), 7, a
#define PWM1MD                           BANKMASK(PMD3), 0, b
#define PWM1PIE                          BANKMASK(PIE4), 6, a
#define PWM1PIF                          BANKMASK(PIR4), 6, a
#define PWM1PIP                          BANKMASK(IPR4), 6, a
#define PWM2ERSPPS0                      BANKMASK(PWM2ERSPPS), 0, b
#define PWM2ERSPPS1                      BANKMASK(PWM2ERSPPS), 1, b
#define PWM2ERSPPS2                      BANKMASK(PWM2ERSPPS), 2, b
#define PWM2ERSPPS3                      BANKMASK(PWM2ERSPPS), 3, b
#define PWM2ERSPPS4                      BANKMASK(PWM2ERSPPS), 4, b
#define PWM2ERSPPS5                      BANKMASK(PWM2ERSPPS), 5, b
#define PWM2IE                           BANKMASK(PIE5), 7, a
#define PWM2IF                           BANKMASK(PIR5), 7, a
#define PWM2IP                           BANKMASK(IPR5), 7, a
#define PWM2MD                           BANKMASK(PMD3), 1, b
#define PWM2PIE                          BANKMASK(PIE5), 6, a
#define PWM2PIF                          BANKMASK(PIR5), 6, a
#define PWM2PIP                          BANKMASK(IPR5), 6, a
#define PWM3ERSPPS0                      BANKMASK(PWM3ERSPPS), 0, b
#define PWM3ERSPPS1                      BANKMASK(PWM3ERSPPS), 1, b
#define PWM3ERSPPS2                      BANKMASK(PWM3ERSPPS), 2, b
#define PWM3ERSPPS3                      BANKMASK(PWM3ERSPPS), 3, b
#define PWM3ERSPPS4                      BANKMASK(PWM3ERSPPS), 4, b
#define PWM3ERSPPS5                      BANKMASK(PWM3ERSPPS), 5, b
#define PWM3IE                           BANKMASK(PIE7), 7, a
#define PWM3IF                           BANKMASK(PIR7), 7, a
#define PWM3IP                           BANKMASK(IPR7), 7, a
#define PWM3MD                           BANKMASK(PMD3), 2, b
#define PWM3PIE                          BANKMASK(PIE7), 6, a
#define PWM3PIF                          BANKMASK(PIR7), 6, a
#define PWM3PIP                          BANKMASK(IPR7), 6, a
#define PWMIN0PPS0                       BANKMASK(PWMIN0PPS), 0, b
#define PWMIN0PPS1                       BANKMASK(PWMIN0PPS), 1, b
#define PWMIN0PPS2                       BANKMASK(PWMIN0PPS), 2, b
#define PWMIN0PPS3                       BANKMASK(PWMIN0PPS), 3, b
#define PWMIN0PPS4                       BANKMASK(PWMIN0PPS), 4, b
#define PWMIN0PPS5                       BANKMASK(PWMIN0PPS), 5, b
#define PWMIN1PPS0                       BANKMASK(PWMIN1PPS), 0, b
#define PWMIN1PPS1                       BANKMASK(PWMIN1PPS), 1, b
#define PWMIN1PPS2                       BANKMASK(PWMIN1PPS), 2, b
#define PWMIN1PPS3                       BANKMASK(PWMIN1PPS), 3, b
#define PWMIN1PPS4                       BANKMASK(PWMIN1PPS), 4, b
#define PWMIN1PPS5                       BANKMASK(PWMIN1PPS), 5, b
#define PWS0                             BANKMASK(NCO1CLK), 5, b
#define PWS1                             BANKMASK(NCO1CLK), 6, b
#define PWS2                             BANKMASK(NCO1CLK), 7, b
#define RA0                              BANKMASK(PORTA), 0, b
#define RA0PPS0                          BANKMASK(RA0PPS), 0, b
#define RA0PPS1                          BANKMASK(RA0PPS), 1, b
#define RA0PPS2                          BANKMASK(RA0PPS), 2, b
#define RA0PPS3                          BANKMASK(RA0PPS), 3, b
#define RA0PPS4                          BANKMASK(RA0PPS), 4, b
#define RA0PPS5                          BANKMASK(RA0PPS), 5, b
#define RA1                              BANKMASK(PORTA), 1, b
#define RA1PPS0                          BANKMASK(RA1PPS), 0, b
#define RA1PPS1                          BANKMASK(RA1PPS), 1, b
#define RA1PPS2                          BANKMASK(RA1PPS), 2, b
#define RA1PPS3                          BANKMASK(RA1PPS), 3, b
#define RA1PPS4                          BANKMASK(RA1PPS), 4, b
#define RA1PPS5                          BANKMASK(RA1PPS), 5, b
#define RA2                              BANKMASK(PORTA), 2, b
#define RA2PPS0                          BANKMASK(RA2PPS), 0, b
#define RA2PPS1                          BANKMASK(RA2PPS), 1, b
#define RA2PPS2                          BANKMASK(RA2PPS), 2, b
#define RA2PPS3                          BANKMASK(RA2PPS), 3, b
#define RA2PPS4                          BANKMASK(RA2PPS), 4, b
#define RA2PPS5                          BANKMASK(RA2PPS), 5, b
#define RA3                              BANKMASK(PORTA), 3, b
#define RA3PPS0                          BANKMASK(RA3PPS), 0, b
#define RA3PPS1                          BANKMASK(RA3PPS), 1, b
#define RA3PPS2                          BANKMASK(RA3PPS), 2, b
#define RA3PPS3                          BANKMASK(RA3PPS), 3, b
#define RA3PPS4                          BANKMASK(RA3PPS), 4, b
#define RA3PPS5                          BANKMASK(RA3PPS), 5, b
#define RA4                              BANKMASK(PORTA), 4, b
#define RA4PPS0                          BANKMASK(RA4PPS), 0, b
#define RA4PPS1                          BANKMASK(RA4PPS), 1, b
#define RA4PPS2                          BANKMASK(RA4PPS), 2, b
#define RA4PPS3                          BANKMASK(RA4PPS), 3, b
#define RA4PPS4                          BANKMASK(RA4PPS), 4, b
#define RA4PPS5                          BANKMASK(RA4PPS), 5, b
#define RA5                              BANKMASK(PORTA), 5, b
#define RA5PPS0                          BANKMASK(RA5PPS), 0, b
#define RA5PPS1                          BANKMASK(RA5PPS), 1, b
#define RA5PPS2                          BANKMASK(RA5PPS), 2, b
#define RA5PPS3                          BANKMASK(RA5PPS), 3, b
#define RA5PPS4                          BANKMASK(RA5PPS), 4, b
#define RA5PPS5                          BANKMASK(RA5PPS), 5, b
#define RA6                              BANKMASK(PORTA), 6, b
#define RA6PPS0                          BANKMASK(RA6PPS), 0, b
#define RA6PPS1                          BANKMASK(RA6PPS), 1, b
#define RA6PPS2                          BANKMASK(RA6PPS), 2, b
#define RA6PPS3                          BANKMASK(RA6PPS), 3, b
#define RA6PPS4                          BANKMASK(RA6PPS), 4, b
#define RA6PPS5                          BANKMASK(RA6PPS), 5, b
#define RA7                              BANKMASK(PORTA), 7, b
#define RA7PPS0                          BANKMASK(RA7PPS), 0, b
#define RA7PPS1                          BANKMASK(RA7PPS), 1, b
#define RA7PPS2                          BANKMASK(RA7PPS), 2, b
#define RA7PPS3                          BANKMASK(RA7PPS), 3, b
#define RA7PPS4                          BANKMASK(RA7PPS), 4, b
#define RA7PPS5                          BANKMASK(RA7PPS), 5, b
#define RB0                              BANKMASK(PORTB), 0, b
#define RB0PPS0                          BANKMASK(RB0PPS), 0, b
#define RB0PPS1                          BANKMASK(RB0PPS), 1, b
#define RB0PPS2                          BANKMASK(RB0PPS), 2, b
#define RB0PPS3                          BANKMASK(RB0PPS), 3, b
#define RB0PPS4                          BANKMASK(RB0PPS), 4, b
#define RB0PPS5                          BANKMASK(RB0PPS), 5, b
#define RB1                              BANKMASK(PORTB), 1, b
#define RB1PPS0                          BANKMASK(RB1PPS), 0, b
